app/views/shelters/show.html.erb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."shelter_id" = $1  [["shelter_id", 1]]
---

<% @shelter.reviews.each do |review| %>