app/controllers/favorites_controller.rb

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def update
    pet = Pet.find(params[:pet_id])