app/controllers/pets_controller.rb

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def show
    @pet = Pet.find(params[:pet_id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @shelter = Shelter.find(params[:shelter_id])

INSERT INTO "pets" ("image", "name", "approximate_age", "sex", "shelter_id", "adoption_status", "description") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    Pet.create(pet_params)

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @pet = Pet.find(params[:pet_id])

SELECT  "pets".* FROM "pets" WHERE "pets"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
UPDATE "pets" SET "image" = $1 WHERE "pets"."id" = $2  [["image", "https://wallpapersgood.com/resize/960x800/wallpapers/main2/201645/moana-moana-heihei-hej-hej.jpg"], ["id", 3]]
---
  def update
    @pet = Pet.find(params[:pet_id])
    @pet.update(pet_params)

DELETE FROM "pets" WHERE "pets"."id" = $1  [["id", 7]]
---
  def destroy
    Pet.destroy(params[:pet_id])