app/controllers/reviews_controller.rb

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def new
    @shelter = Shelter.find(params[:shelter_id])

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "reviews" ("title", "rating", "content", "optional_picture", "shelter_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "Testing Shelter Ownership"], ["rating", "3"], ["content", "Here we go again"], ["optional_picture", ""], ["shelter_id", 1]]
---
  def create
    @shelter = Shelter.find(params[:shelter_id])
    review = @shelter.reviews.new(review_params)
      if review.save

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @review = Review.find(params[:review_id])

SELECT  "reviews".* FROM "reviews" WHERE "reviews"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "reviews" SET "rating" = $1 WHERE "reviews"."id" = $2  [["rating", "5"], ["id", 7]]
---
  def update
    review = Review.find(params[:review_id])
    if review.update(review_params)

SELECT  "shelters".* FROM "shelters" WHERE "shelters"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def destroy
    review = Review.find(params[:review_id])
    shelter = Shelter.find(review.shelter_id)